Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестонахождениеОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьПредъявленСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьУчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьНомерВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьКодСпособаПолучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьНДСПредъявленКВычету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьКодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьДатаВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnКоличествоНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnСчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnСтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратнаяТара</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОтражениеВУСН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оборудование</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АгентскиеУслуги</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>itnДома</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДополнительныеСвойстваНоменклатурныхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойстваНоменклатурныхГрупп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокументаУслуги/Ext/Form/Module.bsl
&НаКлиенте
Процедура itnЗаполнитьПеред(Команда)
	
	itnЗаполнитьПередНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура itnЗаполнитьПередНаСервере()
	
	Объект.itnДома.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСвойстваНоменклатурныхГрупп.НоменклатурнаяГруппа КАК Дом,
	|	ДополнительныеСвойстваНоменклатурныхГрупп.Площадь КАК Площадь,
	|	ДополнительныеСвойстваНоменклатурныхГрупп.Используется КАК Использовать
	|ИЗ
	|	РегистрСведений.ДополнительныеСвойстваНоменклатурныхГрупп КАК ДополнительныеСвойстваНоменклатурныхГрупп";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из Результат Цикл
		НовСтрока = Объект.itnДома.Добавить();
		НовСтрока.Дом = Строка.Дом;
		НовСтрока.Площадь = Строка.Площадь;
		НовСтрока.Использовать = Строка.Использовать;
	КонецЦикла;
	
КонецПроцедуры               

&НаКлиенте
Процедура itnВыделитьВсёСнятьВыделениеПосле(Команда)

	Если Объект.itnДома.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
		КоличествоОтмеченных = 0;
	Для каждого Строка Из Объект.itnДома Цикл
		Если Строка.Использовать Тогда
			КоличествоОтмеченных = КоличествоОтмеченных + 1;
		КонецЕсли;
	КонецЦикла;
	
		Если КоличествоОтмеченных = Объект.itnДома.Количество() Тогда
		НовоеЗначение = Ложь;
	Иначе
		НовоеЗначение = Истина;
	КонецЕсли;
	
	Для каждого Строка Из Объект.itnДома Цикл
		Строка.Использовать = НовоеЗначение;
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Процедура itnРаспределитьПослеНаСервере()
	
	// 1. Считаем общую площадь только отмеченных домов
	ОбщаяПлощадь = 0;
	КоличествоДомов = 0;
	
	Для каждого Строка Из Объект.itnДома Цикл
		Если Строка.Использовать Тогда
			ОбщаяПлощадь = ОбщаяПлощадь + Строка.Площадь;
			КоличествоДомов = КоличествоДомов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщаяПлощадь = 0 Тогда
		Сообщить("Нет отмеченных домов с заполненной площадью");
		Возврат;
	КонецЕсли;
	
	// 2. Получаем сумму документа и количество
	СуммаДокумента = Объект.itnСумма;
	КоличествоНоменклатуры = Объект.itnКоличествоНоменклатуры;
	
	// 3. Очищаем таблицу услуг
	Объект.Услуги.Очистить();
	                Для каждого Колонка Из Объект.Услуги.Колонки Цикл
	Сообщить(Колонка.Имя);
КонецЦикла;
	// 4. Распределяем и заполняем услуги
	СуммаРаспределенная = 0;
	Индекс = 0;
	
	Для каждого Строка Из Объект.itnДома Цикл
		Если Строка.Использовать Тогда
			
			// Расчет суммы для текущего дома
			Доля = Строка.Площадь / ОбщаяПлощадь;
			
			Если Индекс = КоличествоДомов - 1 Тогда
				// Последний дом - берем остаток
				СуммаСтроки = СуммаДокумента - СуммаРаспределенная;
			Иначе
				СуммаСтроки = Окр(СуммаДокумента * Доля, 2);
				СуммаРаспределенная = СуммаРаспределенная + СуммаСтроки;
			КонецЕсли;
			
			// Сохраняем сумму в таблицу домов
			Попытка
				Строка.ДомаСумма = СуммаСтроки;
			Исключение
				// Если поля нет - игнорируем
			КонецПопытки;
			
			// Добавляем строку в услуги
			НовУслуга = Объект.Услуги.Добавить();
			
			// Заполняем основные поля услуги
			НовУслуга.Номенклатура = Строка.Дом;
			НовУслуга.Количество = КоличествоНоменклатуры;
			НовУслуга.Цена = СуммаСтроки / КоличествоНоменклатуры;
			НовУслуга.Сумма = СуммаСтроки;
			
			// Копируем ставку НДС из шапки
			Попытка
				НовУслуга.СтавкаНДС = Объект.СтавкаНДС;
			Исключение
				// Если поля нет - игнорируем
			КонецПопытки;
			
			// Заполняем содержание
			Попытка
				НовУслуга.Содержание = "Услуги по дому: " + Строка.Дом.Наименование;
			Исключение
				// Если поля нет - игнорируем
			КонецПопытки;
			
			// *** ЗАПОЛНЕНИЕ СУБКОНТО ***
			
			// Очищаем субконто (если нужно)
			Попытка
				НовУслуга.Субконто.Очистить();
			Исключение
				// Если поля нет - игнорируем
			КонецПопытки;
			
			// Добавляем счет затрат
			Попытка
				Если Объект.itnСчетЗатрат.Пустая() = Ложь Тогда
					НовУслуга.СчетЗатрат = Объект.itnСчетЗатрат;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			// Добавляем статью затрат
			Попытка
				Если Объект.itnСтатьяЗатрат.Пустая() = Ложь Тогда
					НовУслуга.СтатьяЗатрат = Объект.itnСтатьяЗатрат;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			// Добавляем подразделение (если есть)
			Попытка
				Если Объект.itnПодразделение.Пустая() = Ложь Тогда
					НовУслуга.Подразделение = Объект.itnПодразделение;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			// *** РАБОТА С СУБКОНТО (если используется структура Субконто) ***
			Попытка
				// Если в таблице есть колонка Субконто (массив значений субконто)
				Если НовУслуга.Свойство("Субконто") Тогда
					
					// Очищаем субконто
					НовУслуга.Субконто.Очистить();
					
					// Добавляем субконто по счету затрат
					// Обычно субконто имеют виды: Подразделение, СтатьяЗатрат, Номенклатура и т.д.
					
					// Пример добавления субконто (зависит от конфигурации)
					// НовУслуга.Субконто.Добавить(Объект.itnПодразделение);
					// НовУслуга.Субконто.Добавить(Объект.itnСтатьяЗатрат);
					// НовУслуга.Субконто.Добавить(Строка.Дом);
					
				КонецЕсли;
			Исключение
				// Если нет субконто - игнорируем
			КонецПопытки;
			
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Распределение выполнено. Создано услуг: " + Индекс);
	
КонецПроцедуры
